<div class="alert alert-success">
    <b>Author</b>:

      Rashik Rahman
      17201012@uap-bd.edu

</div>

**[Click here to see class lecture](https://drive.google.com/file/d/1vuk-N6BitWoNY_5jLPDyHna66CRVAMxB/view)**

![](figs/1.PNG)

![](figs/2.PNG)

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=['Name', 'Type'])
df.head()

Empty DataFrame
Columns: [Name, Type]
Index: []

In [10]:
def insert(df, name, typ):
    if (name not in df.Name.values) or (typ not in df.Type.values):
        df.loc[-1] = [name, typ]
        df.index = df.index + 1
        df = df.sort_index()
    return df

def search(df, name):
    return df.loc[df['Name'] == name]

def delete(df, name):
    try:
        idx = df.loc[df['Name'] == name].index[0]
        df.drop([idx],axis=0,inplace=True)
        df.reset_index(inplace=True)
        df.drop('index',axis=1,inplace=True)
        return df
    except:
        print('Name not found')
        return df
    
def update(df, name=None, new_name=None, typ=None, new_typ=None):
    if name:
        if name in df.Name.values:
            df.loc[df.Name == name,'Name'] = new_name
    if typ:
        if typ in df.Type.values:
            df.loc[df.Type == typ,'Type'] = new_typ
            
    return df
        
def show():
    print(df)
    
    
def getHashKey(df, name):
    return df.loc[df['Name'] == name].index[0]

In [11]:

df = insert(df,'int','INTEGER')
df = insert(df,'myFunction','FUNCTION')
df = insert(df,'x','ID')
df = insert(df,'5','NUM')
df

         Name      Type
0      Mariam     float
1      Mariam       NUM
2           5       NUM
3           x        ID
4  myFunction  FUNCTION
5         int   INTEGER

In [6]:
df = insert(df,'Mariam','float')
df

         Name      Type
0      Mariam     float
1      Mariam       NUM
2           5       NUM
3           x        ID
4  myFunction  FUNCTION
5         int   INTEGER

In [5]:
search(df, '5')

  Name Type
0    5  NUM

In [6]:
df = delete(df,name='x')
df

         Name      Type
0           5       NUM
1  myFunction  FUNCTION
2         int   INTEGER

In [7]:
# Show
show()

         Name      Type
0           5       NUM
1  myFunction  FUNCTION
2         int   INTEGER

In [8]:
df = update(df, '5','6','NUM','Number')
df

         Name      Type
0           6    Number
1  myFunction  FUNCTION
2         int   INTEGER

In [9]:
getHashKey(df,'6')

0